{
  "timestamp": "2025-11-09T05:51:53.613212",
  "burnout_risk_score": 8.0,
  "risk_level": "HIGH 🔴",
  "top_insights": [
    "The switching rate is critically high, averaging 132.8 switches/hour and peaking at 324 switches/hour, much higher than the sustainable rate of 20-40/hour.",
    "52.5% of sessions are less than half the average session duration, indicative of constant task switching and fragmented work pattern.",
    "All work occurs in the evening, which likely interferes with the individual's circadian rhythms and sleep cycle, contributing to burnout risk.",
    "Extended sessions (>200% of average) occurring 18.7% of the time implies prolonged work without breaks, indicative of potential overwork.",
    "The total unique windows detected is 87, indicating high contextual shifting demanding cognitive resources."
  ],
  "flags_detected": 5,
  "flags": [
    {
      "category": "Fragmentation",
      "severity": 10,
      "message": "The user has a critically high average switching rate of 132.8/hour and peak of 324/hour, indicating an unsustainable level of context-switching.",
      "prescription": "Implement strict time-blocking strategies to consolidate focus blocks, aiming to limit context switches to under 40/hour."
    },
    {
      "category": "Session Pattern",
      "severity": 8,
      "message": "52.5% of sessions are brief, suggesting excessive interruption and reduced productivity.",
      "prescription": "Set clear objectives for each session and use techniques like the Pomodoro Technique to maintain focus."
    },
    {
      "category": "Sleep Disruption",
      "severity": 7,
      "message": "100% evening work potentially impacts natural sleep cycles, leading to reduced sleep quality and increased burnout risk.",
      "prescription": "Gradually shift work sessions to earlier in the day, aiming for a minimum 3-hour work-free period before bedtime to enhance sleep quality."
    },
    {
      "category": "Overwork",
      "severity": 6,
      "message": "Extended sessions longer than twice the average are noted 18.7% of the time, risking reduced cognitive recovery.",
      "prescription": "Schedule regular short breaks between extended periods to ensure cognitive recovery and manage fatigue effectively."
    },
    {
      "category": "Digital Ergonomics",
      "severity": 7,
      "message": "With 87 unique windows accessed, there is significant cognitive load required to manage complex digital environments.",
      "prescription": "Simplify digital environments by reducing open windows and using tool integrations to streamline task management. Limit active windows to fewer than 10 at a time."
    }
  ],
  "metrics_summary": "\nWORK SESSION METRICS:\n- Total logged time: 3.59 hours\n- Total window switches: 482\n- Average switching rate: 132.8 switches/hour\n- Peak switching rate: 324.0 switches/hour\n- Average session duration: 2.3 minutes\n\nSESSION PATTERNS:\n- Brief sessions (<50% of average): 52.5%\n- Extended sessions (>200% of average): 18.7%\n- Unique windows detected: 87\n\nTEMPORAL PATTERNS:\n- Evening work (after 6 PM): 100.0%\n- Early morning work (before 7 AM): 0.0%\n- Hours active: 5\n- Time distribution: {'Night': 2083, 'Evening': 503}\n\nRECENT ACTIVITY INTENSITY:\n- Max recent switching (last 15 min): 81 switches\n- Average unique windows in last 10 intervals: 2.2\n"
}